src/Documents/ВозвратТоваровОтКлиента/ВозвратТоваровОтКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="69907d01-2fac-4a13-a6a2-2cf0af2a60bf">
  <name>ВозвратТоваровОтКлиента</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="801f7d80-e33b-43f3-ac0b-88b3d7ee5050">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="482efeb2-6584-4e29-acb0-718c0859e513">
    <name>ДокументРеализации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="479ba110-d494-41e5-82d9-be4b089a90d7">
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="540b6290-f046-4049-ac65-5814b24bea80">
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="483844b1-4482-44da-9daa-f17bdaaa027b">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="791e3422-524c-46b4-bdf5-1bf5b042f1b2">
    <name>КлиентПартнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3100f799-7f27-4673-86ab-8bcace741bab">
    <name>КлиентКонтрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="21821ac6-c376-48f9-9d4c-8499fa98f4cc">
    <name>КлиентДоговор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a876f4a3-9894-49f6-9bf8-2a78539f44bc">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1ab231dd-6cb1-4eba-b904-77e3ee931bed">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="25ecdf9b-133b-4180-b9c4-ea2233e14413">
    <name>Менеджер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="41cdf308-8947-419f-abb9-d77a2040b6ad">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e868f73e-2841-4640-9fe6-95c6067f9f61">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="dacb0bc0-61de-4bdf-8491-9f4ea53a0b59">
    <name>НомерВходящегоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="3be3a509-1cb4-47ee-857e-e0ce713fe870">
    <name>ДатаВходящегоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="0c7d1756-e131-4741-9a18-f57893355a23">
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="19827912-67b6-4817-ab4b-62c3f704fff4">
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4285aa74-cde2-40a3-aad1-97f73fab3d98">
    <name>ДатаПоступления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ax_УС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ax_ПроверенСкладом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ax_ЗавозТребуетсяДоставка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ax_МаксимальныйКодСтроки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections extendedConfigurationObject="d97593cc-9e00-40de-8188-964163b9a47f">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="c2f05c95-112c-49a8-9622-4a54d2309616">
      <name>ХарактеристикаНабора</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="633bfa15-0869-4d94-bc0a-e9411f7119dd">
      <name>СтатусУказанияСерий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>2</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="cf828e93-f8c0-4444-9c08-2dd7032bf494">
      <name>Порча</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="d025c151-feb1-46f1-96df-79fbe4b8d20e">
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="1fb5892b-e8f0-4be4-ad14-feed7c553f12">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="ac517b2f-8bbe-44ef-b513-0e5f19499cfa">
      <name>ХарактеристикаОприходование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="6f077424-7739-4132-8543-5b4e84f4f846">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="77e19946-3aa6-42c6-bdbd-8071c8347d2f">
      <name>НоменклатураНабора</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="170fa9dd-8626-4d47-a7a8-120763cd74f7">
      <name>КодСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="ae7da8e1-be5b-4984-bcdd-fe6ce391798c">
      <name>Штрихкод</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>200</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="0d5ab1a1-c2ec-4fef-b6aa-cf48e114f62d">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="8ec9788f-c232-4ca8-b273-1948648ca8c8">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="e168c4d6-c2e0-4edb-aae2-742d1114fcb1">
      <name>НоменклатураОприходование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="f6b893e0-9dee-4373-8c55-1d2ed7baf790">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="3579f135-e7ba-4fbd-8153-29e0e21b5115">
      <name>КоличествоПоРНПТ</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>23</precision>
            <scale>11</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="72d0be57-210d-4f57-bb99-9a68a3e4fc94">
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="dda0c316-494c-49fa-8dc3-0f2b7fb432c7">
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="f0f98c9c-e30a-44dc-aac5-88c55f74d1c0">
      <name>СтавкаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="83a397d6-087d-43ea-8a1b-535791c0ad6f">
      <name>СуммаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="47a744cb-233b-44b2-908e-7ead60620ba2">
      <name>СуммаСНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="c1a2594d-47b7-4648-b8df-bf2ad27ebc9c">
      <name>ДокументРеализации</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="d2cf9a8e-843b-437e-9287-aef240d48713">
      <name>НомерГТД</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ax_КодСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="094380cc-a015-4fbd-abd2-9ae225c5c884">
    <name>ВидыЗапасов</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="2498c164-3b04-4152-ab38-f8b0bc66e352">
      <name>ИдентификаторСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/ВозвратТоваровОтКлиента/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ax_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	ЭлементГруппаОсновное = Элементы.Найти("ГруппаОсновное");
	
	ГруппаПараметрыОбменаОсновная = Элементы
		.Добавить("ax_ГруппаПараметрыОбменаОсновная",Тип("ГруппаФормы"), ЭлементГруппаОсновное);
	ГруппаПараметрыОбменаОсновная.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаПараметрыОбменаОсновная.ОтображатьЗаголовок = Истина;
	ГруппаПараметрыОбменаОсновная.Заголовок = "ТД Форт (параметры обмена с WMS)";
	ГруппаПараметрыОбменаОсновная.Отображение = ОтображениеОбычнойГруппы.ОбычноеВыделение;
	ГруппаПараметрыОбменаОсновная.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	ГруппаПараметрыОбменаОсновная.ЦветТекстаЗаголовка = Новый Цвет(25, 100, 100);
	
	ЭлементУС = Элементы.Добавить("ax_УС", Тип("ПолеФормы"), ГруппаПараметрыОбменаОсновная);
	ЭлементУС.ПутьКДанным = "Объект.ax_УС";
	ЭлементУС.Видимость = Истина;
	ЭлементУС.Вид = ВидПоляФормы.ПолеФлажка;
	ЭлементУС.ЦветТекста = Новый Цвет(25, 100, 100);
	ЭлементУС.ЦветРамки = Новый Цвет(25, 100, 100);
	ЭлементУС.Заголовок = "Отправить в УС";
	ЭлементУС.ЦветТекстаЗаголовка = Новый Цвет(25, 100, 100);
	
	ЭлементПроверенСкладом = Элементы
		.Добавить("ax_ПроверенСкладом", Тип("ПолеФормы"), ЭлементГруппаОсновное);
	ЭлементПроверенСкладом.ПутьКДанным = "Объект.ax_ПроверенСкладом";
	ЭлементПроверенСкладом.Видимость = Истина;
	ЭлементПроверенСкладом.Вид = ВидПоляФормы.ПолеФлажка;
	ЭлементПроверенСкладом.ЦветТекста = Новый Цвет(25, 100, 100);
	ЭлементПроверенСкладом.ЦветРамки = Новый Цвет(25, 100, 100);
	ЭлементПроверенСкладом.Заголовок = "Проверен складом";
	ЭлементПроверенСкладом.ЦветТекстаЗаголовка = Новый Цвет(25, 100, 100);
	
	ЭлементТребуетсяДоставка = Элементы
		.Добавить("ax_ЗавозТребуетсяДоставка", Тип("ПолеФормы"), ЭлементГруппаОсновное);
	ЭлементТребуетсяДоставка.ПутьКДанным = "Объект.ax_ЗавозТребуетсяДоставка";
	ЭлементТребуетсяДоставка.Видимость = Истина;
	ЭлементТребуетсяДоставка.Вид = ВидПоляФормы.ПолеФлажка;
	ЭлементТребуетсяДоставка.ЦветТекста = Новый Цвет(25, 100, 100);
	ЭлементТребуетсяДоставка.ЦветРамки = Новый Цвет(25, 100, 100);
	ЭлементТребуетсяДоставка.Заголовок = "Требуется доставка";
	ЭлементТребуетсяДоставка.ЦветТекстаЗаголовка = Новый Цвет(25, 100, 100);
	
КонецПроцедуры
